       IDENTIFICATION DIVISION.
       PROGRAM-ID. olamundo.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "ola, mundo!"
            STOP RUN.
       END PROGRAM olamundo.
