       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX4.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 NOME          PIC X(30).
       77 MATERIA       PIC X(15).
       77 NOTA          PIC 9(02).
       PROCEDURE DIVISION.
           DISPLAY "POR FAVOR, DIGITE SEU NOME"
           ACCEPT NOME

           DISPLAY "DIGITE A MATERIA QUE VOCE ESTA CURSANDO"
           ACCEPT MATERIA

           DISPLAY "INFORME A NOTA QUE VOCE TIROU NESTA DISCIPLINA"
           ACCEPT NOTA

           DISPLAY "OLA," NOME
           DISPLAY "VOCE ESTA MATRICULADO NA MATERIA " MATERIA
           DISPLAY "E SUA NOTA FOI " NOTA
            STOP RUN.
       END PROGRAM EX4.
