       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MENSAGEM     PIC X(20) VALUE SPACES.
       01 NOME         PIC X(20) VALUE SPACES.
       PROCEDURE DIVISION.
           MOVE "COMO VAI MUNDO!" TO MENSAGEM
           DISPLAY MENSAGEM
           DISPLAY "POR FAVOR, DIGITE SEU NOME:"
           ACCEPT NOME
           DISPLAY "PRAZER EM CONHECE-LO," NOME
           MOVE "TENHA UM OTIMO DIA" TO MENSAGEM
           DISPLAY MENSAGEM
            STOP RUN.
       END PROGRAM EX2.
