       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX3.
       AUTHOR. GABRIEL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 LARGURA         PIC 9(003) VALUE ZEROS.
       77 ALTURA          PIC 9(003) VALUE ZEROS.
       77 AREA-RESULT     PIC 9(006) VALUE ZEROS.
       PROCEDURE DIVISION.
           DISPLAY "CALCULO DA AREA (QUADRADOS)"
           DISPLAY "DIGITE A LARGURA:"
           ACCEPT LARGURA
           DISPLAY "DIGITE A ALTURA:"
           ACCEPT ALTURA
           MULTIPLY LARGURA BY ALTURA GIVING AREA-RESULT
           DISPLAY "AREA: " AREA-RESULT
            STOP RUN.
       END PROGRAM EX3.
